loadsyntax "ArabicSyntax.ring"
حمل "ArabicFunctions.ring"
حمل "ArabicClasses.ring"
حمل "KSUAILibrary.ring"
حمل "Number_problem_Cost.ring"
حمل "Number_problem.ring"

اطبع سطر + " مثال بحث سطحي اولا:-" + سطر// BFS example
المشكلة = انشاء مشكلة_رقم

//حل_المشكلة = بحث_سطحي_اولا(المشكلة)

طباعة_بحث_سطحي_اولا(المشكلة)

اطبع سطر + " مثال بحث عميق اولا:-" + سطر//DFS example
المشكلة = انشاء مشكلة_رقم

//حل_المشكلة = بحث_عميق_اولا(المشكلة)

طباعة_بحث_عميق_اولا(المشكلة)


اطبع سطر + "مثال مشكلة رقم بتكلفة:-" + سطر// UCS example
المشكلة = انشاء مشكلة_رقم_بتكلفة

//حل_المشكلة = بحث_باستخدام_تكلفة(المشكلة)

طباعة_بحث_باستخدام_تكلفة(المشكلة)

اطبع سطر + "مثال بحث تعمق متكرر:-" + سطر// IDS example
المشكلة = انشاء مشكلة_رقم

//حل_المشكلة = بحث_تعمق_متكرر(المشكلة)

طباعة_بحث_تعمق_متكرر(المشكلة)


