loadsyntax "ArabicSyntax.ring"
حمل "ArabicFunctions.ring"
حمل "ArabicClasses.ring"
مشكلة = انشاء مشكلة_رقم

//مشكلة.الدلالة = فراغ

اطبع مشكلة
متابعين = انشاء طابور
كررمن ر = 1 الى طول(مشكلة.التتابع(مشكلة.الحالة_البدائية))
القيمة = مشكلة.التتابع(مشكلة.الحالة_البدائية)[ر]
متابعين.اضف(القيمة)
التالي


متابعين.طباعة()
اطبع "=======" + سطر

طالما (متابعين.قيمة(1) != فراغ) مع (متابعين.قيمة(1) != مشكلة.الهدف)


اطبع "------------------" + سطر

قف = متابعين.الطول()
كررمن ن = 1 الى قف
اذا (متابعين.قيمة(1) = مشكلة.الهدف)
خروج
نهاية

كررمن ر = 1 الى طول(مشكلة.التتابع(متابعين.قيمة(ن)))
القيمة = مشكلة.التتابع(متابعين.قيمة(ن))[ر]
متابعين.اضف(القيمة)
التالي

متابعين.احذف()

اطبع "==============" + سطر
متابعين.طباعة()
اطبع "==============" + سطر
التالي
نهاية
//متابعين.طباعة()

/*
 اذا متابعين[1] = مشكلة9.الهدف
	اطبع "صح"
والا
اطبع "خطأ"
نهاية
*/





عنصر مشكلة_رقم

	الحالة_البدائية = 0
	التكلفة = 1
	الدلالة = 0
الهدف = 9
/*
	دالة الهدف
	ارجع 9
*/
	دالة التتابع حالة
		التابعين = []
		اضافة(التابعين, حالة+1)
		اضافة(التابعين, حالة+2)
		ارجع التابعين
