
حمل "../ArabicFunctions.ring"
حمل "../ArabicClasses.ring"


عنصر مشكلة_رقم

	الحالة_البدائية = 0
	التكلفة = 0
	الهدف = 13
	البعد = 0
	عدد_الخطوات = 0

	دالة اختبار_الهدف (الحالة)


		اذا الحالة = الهدف
			ارجع صح
		والا
			ارجع خطا
		نهاية


	دالة توليد (حالة)


		التابعين = []
		البعد++

		اذا (البعد = الهدف)
			رابط = [حالة+1,1,-البعد - الهدف - 1000]
			اضافة(التابعين, رابط)
			البعد++
			رابط = [حالة+2,1,البعد-1]
			اضافة(التابعين, رابط)

		والااذا (البعد < الهدف)
			رابط = [حالة+1,1,-البعد - الهدف]
			اضافة(التابعين, رابط)
			البعد++
			رابط = [حالة+2,1,-البعد - الهدف - 1]
			اضافة(التابعين, رابط)

		والا
			رابط = [حالة+1,1,البعد]
			اضافة(التابعين, رابط)
			البعد++
			رابط = [حالة+2,1,البعد-1]
			اضافة(التابعين, رابط)
		نهاية

		ارجع التابعين


	دالة خطوة (حالة)


		التابعين = []

		اذا (عدد_الخطوات < مرفوع_الاس(3,5))
			عدد_الخطوات++
			اضافة(التابعين, عشوائي(99))
			اضافة(التابعين, عشوائي(99))
			اضافة(التابعين, عشوائي(99))



			ارجع التابعين
		نهاية

		ارجع فراغ
