loadsyntax "ArabicSyntax.ring"

//-------------تجربة----------------------------------

//-------------دالة ----------------------------------

دالة هل_جملة س
ارجع isString(س)

//-------------دالة ----------------------------------
دالة هل_رقم س
ارجع isnumber(س)

//-------------دالة ----------------------------------

دالة هل_قائمة س
ارجع islist(س)

//-------------دالة ----------------------------------

دالة هل_فراغ س
ارجع isnull(س)

//-------------دالة ----------------------------------

دالة نوع س
ارجع type(س)

//-------------دالة ----------------------------------

دالة هل_الجملة_متصلة س
ارجع isalnum(س)

//-------------دالة ----------------------------------

دالة هل_الجملة_حروف س
ارجع isalpha(س)

//-------------دالة ----------------------------------

دالة هل_معرفه س
ارجع iscntrl(س)

//-------------دالة ----------------------------------

دالة هل_الجملة_ارقام س
ارجع isdigit(س)

//-------------دالة ----------------------------------

دالة هل_رسم_بياني س
ارجع isgraph(س)

//-------------دالة ----------------------------------

دالة هل_صغير س
ارجع islower(س)

//-------------دالة ----------------------------------

دالة هل_طباعة س
ارجع isprint(س)

//-------------دالة ----------------------------------

دالة هل_علامة_ترقيم س
ارجع ispunct(س)

//-------------دالة ----------------------------------

دالة هل_مسافة س
ارجع isspace(س)

//-------------دالة ----------------------------------

دالة هل_كبير س
ارجع isupper(س)

//-------------دالة ----------------------------------

دالة هل_سداسي_عشري س
ارجع isxdigit(س)

//-------------دالة ----------------------------------

دالة تحويل_لرقم س
ارجع number(س)

//-------------دالة ----------------------------------

دالة تحويل_لجملة س
ارجع string(س)

//-------------دالة ----------------------------------

دالة تحويل_آسكي س
ارجع ascii(س)

//-------------دالة ----------------------------------

دالة تحويل_لحرف س
ارجع char(س)

//-------------دالة ----------------------------------

دالة تحويل_لسداسي_عشري س
ارجع hex(س)

//-------------دالة ----------------------------------

دالة تحويل_لكسر_عشري س
ارجع dec(س)

//-------------دالة ----------------------------------

دالة تحويل_جملة_لسداسي_عشري س
ارجع str2hex(س)

//-------------دالة ----------------------------------

دالة  تحويل_سداسي_عشري_لجملة س
ارجع hex2str(س)
