loadsyntax "ArabicSyntax.ring"

//-------------تجربة ----------------------------------

//-------------دالة ----------------------------------

دالة نظام امر
ارجع System(امر)

//-------------دالة ----------------------------------

دالة اجلب_النظام س
ارجع SysGet(س)

//-------------دالة ----------------------------------

دالة تعيين_النظام س,ص
ارجع SysSet(س,ص)

//-------------دالة ----------------------------------

دالة حذف_عنصر_النظام س
ارجع SysUnset(س)

//-------------دالة ----------------------------------

هل_إم-إس-دوس= IsMSDOS()

//-------------دالة ----------------------------------

هل_ويندوز=IsWindows()

//-------------دالة ----------------------------------

هل_ويندوز64= IsWindows64()

//-------------دالة ----------------------------------

هل_يونيكس= IsUnix()

//-------------دالة ----------------------------------

 هل_ماكنتوش= IsMacOSX()

//-------------دالة ----------------------------------

 هل_لينكس=IsLinux()

//-------------دالة ----------------------------------

هل_فري-بي-اس-دي= IsFreeBSD()

//-------------دالة ----------------------------------


IsAndroid()=هل_اندرويد

//-------------دالة ----------------------------------


اجلب_المعمارية= GetArch()

//-------------دالة ----------------------------------

 ويندوز_سطر_جديد=Windowsnl()

//-------------دالة ----------------------------------

filename()=اسم_الملف

PrevFileName()=اسم_الملف_السابق 
//-------------دالة ----------------------------------
CurrentDir()=المسار_الحالي
//Return the path of the current directory


//-------------دالة ----------------------------------
ExeFileName()=اسم_الملف_التنفيذي
//Return the Ring executable file name
//exefilename() ---> String contains the Ring executable file name
//-------------دالة ----------------------------------


ChDir()=تغيير_المسار

//-------------دالة ----------------------------------

ExeFolder()=مسار_الملفات_التنفيذية
/*
Return the Ring executable file path

Syntax:

exefolder() ---> String contains the Ring executable path*/
//-------------دالة ----------------------------------


Version()=نسخة_رينق
/*
Return the Ring version

Syntax:

version() ---> String contains the Ring version*/
//-------------دالة ----------------------------------


Shutdown()=انهاء_البرنامج
/*
Close the application

Syntax:

shutdown(nStatus) ---> Close the application*/
//-------------دالة ----------------------------------


NofProcessors()=عدد_وحدات_المعالجة
/*We can detect the number of processors using the NofProcessors() Function

Syntax:

NofProcessors() ---> nProcessors*/
//-------------دالة ----------------------------------

